Julioyevenes/file_manager_h747/Common/Libraries/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
  while (i < length)
  {
    uint8_t item_byte = desc[i++];
    size = item_byte & 0x03;
    if (size == 3) size = 4; /* Size 3 means 4 bytes in HID */
    
    type = (item_byte >> 2) & 0x03;
    tag = (item_byte >> 4) & 0x0F;

    /* Read the tag payload (Little Endian) */
    data = 0;
    for (uint8_t j = 0; j < size; j++) {
      if (i < length) data |= (uint32_t)(desc[i++] << (j * 8));
    }
    
    /* Sign extension for correctly reading negative limits */
    int32_t sdata = (int32_t)data;
    if (size == 1 && (data & 0x80)) sdata |= 0xFFFFFF00;
    else if (size == 2 && (data & 0x8000)) sdata |= 0xFFFF0000;    

    if (type == HID_ITEM_TYPE_GLOBAL) /* Tag Global (0x01) */
    {
      if (tag == HID_GLOBAL_ITEM_TAG_USAGE_PAGE) current_usage_page = data;
      else if (tag == HID_GLOBAL_ITEM_TAG_REPORT_SIZE) report_size = data;
      else if (tag == HID_GLOBAL_ITEM_TAG_REPORT_COUNT) report_count = data;
      else if (tag == HID_GLOBAL_ITEM_TAG_LOG_MIN) logical_min = sdata;
      else if (tag == HID_GLOBAL_ITEM_TAG_LOG_MAX) logical_max = sdata;
      else if (tag == HID_GLOBAL_ITEM_TAG_REPORT_ID) 
      {
        /* If the device uses Report IDs, byte 0 of the memory will be the ID */
        /* Therefore, the actual data starts at byte 1 (bit 8) */
        current_report_id = data;
        current_bit_offset = 8; 
      }      
    }
    else if (type == HID_ITEM_TYPE_LOCAL) /* Tag Local (0x02) */
    {
      if (tag == HID_LOCAL_ITEM_TAG_USAGE) {
        if (usage_idx < 15) local_usages[usage_idx++] = data;
      }
      /* Range expansion (Min / Max) */
      else if (tag == HID_LOCAL_ITEM_TAG_USAGE_MIN) {
        usage_min = data;
      }
      else if (tag == HID_LOCAL_ITEM_TAG_USAGE_MAX) {
        usage_max = data;
        /* Expand the range in the local_usages array */
        for (uint32_t u = usage_min; u <= usage_max && usage_idx < 15; u++) {
          local_usages[usage_idx++] = u;
        }
      }
    }
    else if (type == HID_ITEM_TYPE_MAIN) /* Tag Main (0x00) */
    {
      if (tag == HID_MAIN_ITEM_TAG_INPUT) 
      {
        /* Bit 0 of the data indicates whether it is a constant value (padding) */
        uint8_t is_constant = (data & 0x01);          
          
        /* For each reporting account, we generate one item */
        for (uint8_t k = 0; k < report_count; k++) 
        {
          if (!is_constant && HID_Handle->Report_Items.ItemNb < HID_MAX_REPORT_ITEMS) 
          {
            HID_Report_ItemTypedef *item = &HID_Handle->Report_Items.Item[HID_Handle->Report_Items.ItemNb];
            
            item->UsagePage = current_usage_page;
            /* If there are fewer usages than counts, the standard says that the last Usage is repeated */
            item->Usage = local_usages[k < usage_idx ? k : (usage_idx > 0 ? usage_idx - 1 : 0)];
            item->size = report_size;
            item->bit_offset = current_bit_offset;
            /* Setting limits, sign, and resolution */
            item->logical_min  = 0;
            item->logical_max  = 0xFFFFFFFF;            
            /* We use the extracted true logical_min to find out if the axis supports negative values */
            item->sign         = (logical_min < 0) ? 1 : 0;            
            /* Force resolution to 1 to avoid division by zero */
            item->resolution   = 1;            
            
            HID_Handle->Report_Items.ItemNb++;
          }
          current_bit_offset += report_size;
        }
        usage_idx = 0; /* Clear local usages after a Main item */
      }
      else if (tag == HID_MAIN_ITEM_TAG_OUTPUT || tag == HID_MAIN_ITEM_TAG_FEATURE) 
      {
        /* We simply advance the bit offset; we're not interested in this for an input mouse */
        current_bit_offset += (report_size * report_count);
        usage_idx = 0;
      }
    }
  }
}

/**
  * @brief  USBH_HID_GetDeviceType
  *         Return Device function.
  * @param  phost: Host handle
  * @retval HID function: HID_MOUSE / HID_KEYBOARD
  */
HID_TypeTypeDef USBH_HID_GetDeviceType(USBH_HandleTypeDef *phost)
{
  HID_TypeTypeDef   type = HID_UNKNOWN;
  uint8_t InterfaceProtocol;

  if (phost->gState == HOST_CLASS)
  {
    InterfaceProtocol = phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bInterfaceProtocol;
    if (InterfaceProtocol == HID_KEYBRD_BOOT_CODE)
    {
      type = HID_KEYBOARD;
    }
    else
    {
      if (InterfaceProtocol == HID_MOUSE_BOOT_CODE)
      {
        type = HID_MOUSE;
      }
    }
  }
  return type;
}


/**
  * @brief  USBH_HID_GetPollInterval
  *         Return HID device poll time
  * @param  phost: Host handle
  * @retval poll time (ms)
  */
uint8_t USBH_HID_GetPollInterval(USBH_HandleTypeDef *phost)
{
  HID_HandleTypeDef *HID_Handle = (HID_HandleTypeDef *) phost->pActiveClass->pData;

  if ((phost->gState == HOST_CLASS_REQUEST) ||
      (phost->gState == HOST_INPUT) ||
      (phost->gState == HOST_SET_CONFIGURATION) ||
      (phost->gState == HOST_CHECK_CLASS) ||
      ((phost->gState == HOST_CLASS)))
  {
    return (uint8_t)(HID_Handle->poll);
  }
  else
  {
    return 0U;
  }
}
/**
  * @brief  USBH_HID_FifoInit
  *         Initialize FIFO.
  * @param  f: Fifo address
  * @param  buf: Fifo buffer
  * @param  size: Fifo Size
  * @retval none
  */
void USBH_HID_FifoInit(FIFO_TypeDef *f, uint8_t *buf, uint16_t size)
{
  f->head = 0U;
  f->tail = 0U;
  f->lock = 0U;
  f->size = size;
  f->buf = buf;
}

/**
  * @brief  USBH_HID_FifoRead
  *         Read from FIFO.
  * @param  f: Fifo address
  * @param  buf: read buffer
  * @param  nbytes: number of item to read
  * @retval number of read items
  */
uint16_t USBH_HID_FifoRead(FIFO_TypeDef *f, void *buf, uint16_t nbytes)
{
  uint16_t i;
  uint8_t *p;

  p = (uint8_t *) buf;

  if (f->lock == 0U)
  {
    f->lock = 1U;

    for (i = 0U; i < nbytes; i++)
    {
      if (f->tail != f->head)
      {
        *p++ = f->buf[f->tail];
        f->tail++;

        if (f->tail == f->size)
        {
          f->tail = 0U;
        }
      }
      else
      {
        f->lock = 0U;
        return i;
      }
    }
  }

  f->lock = 0U;

  return nbytes;
}

/**
  * @brief  USBH_HID_FifoWrite
  *         Write To FIFO.
  * @param  f: Fifo address
  * @param  buf: read buffer
  * @param  nbytes: number of item to write
  * @retval number of written items
  */
uint16_t USBH_HID_FifoWrite(FIFO_TypeDef *f, void *buf, uint16_t  nbytes)
{
  uint16_t i;
  uint8_t *p;

  p = (uint8_t *) buf;

  if (f->lock == 0U)
  {
    f->lock = 1U;

    for (i = 0U; i < nbytes; i++)
    {
      if ((f->head + 1U == f->tail) ||
          ((f->head + 1U == f->size) && (f->tail == 0U)))
      {
        f->lock = 0U;
        return i;
      }
      else
      {
        f->buf[f->head] = *p++;
        f->head++;

        if (f->head == f->size)
        {
          f->head = 0U;
        }
      }
    }
  }

  f->lock = 0U;

  return nbytes;
}

/**
* @brief  The function is a callback about HID Data events
*  @param  phost: Selected device
* @retval None
*/
__weak void USBH_HID_EventCallback(USBH_HandleTypeDef *phost)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(phost);
}
/**
* @}
*/

/**
* @}
*/

/**
* @}
*/


/**
* @}
*/


/**
* @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
